# Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным
a = int(input("Input number of day of week: "))
print("Yes" if a == 7 else "No")